-- Таблица reader
CREATE TABLE reader
(
    id         SERIAL PRIMARY KEY,
    last_name  VARCHAR(100) NOT NULL,
    first_name VARCHAR(100) NOT NULL,
    address    VARCHAR(255),
    birth_date DATE
);

-- Таблица publisher
CREATE TABLE publisher
(
    pub_name VARCHAR(100) PRIMARY KEY,
    pub_kind VARCHAR(50) NOT NULL
);

-- Таблица book
CREATE TABLE book
(
    isbn      CHAR(13) PRIMARY KEY,
    title     VARCHAR(255) NOT NULL,
    author    VARCHAR(100),
    pages_num INT,
    pub_year  INT,
    pub_name  VARCHAR(100) REFERENCES publisher (pub_name)
);

-- Таблица category
CREATE TABLE category
(
    category_name VARCHAR(100) PRIMARY KEY,
    parent_cat    VARCHAR(100) REFERENCES category (category_name)
);

-- Таблица copy
CREATE TABLE copy
(
    isbn        CHAR(13) REFERENCES book (isbn),
    copy_number INT,
    shelf       VARCHAR(50),
    position    VARCHAR(50),
    PRIMARY KEY (isbn, copy_number)
);

-- Таблица borrowing
CREATE TABLE borrowing
(
    reader_nr   INT REFERENCES reader (id),
    isbn        CHAR(13),
    copy_number INT,
    return_date DATE,
    PRIMARY KEY (reader_nr, isbn, copy_number),
    FOREIGN KEY (isbn, copy_number) REFERENCES copy (isbn, copy_number)
);

-- Таблица book_cat
CREATE TABLE book_cat
(
    isbn          CHAR(13) REFERENCES book (isbn),
    category_name VARCHAR(100) REFERENCES category (category_name),
    PRIMARY KEY (isbn, category_name)
);


-- Вставка данных в таблицу reader
INSERT INTO reader (last_name, first_name, address, birth_date) VALUES
('Иванов', 'Иван', 'Москва', '1990-01-01'),
('Петров', 'Петр', 'Москва', '1985-05-10'),
('Сидоров', 'Алексей', 'Санкт-Петербург', '1992-07-20'),
('Смирнова', 'Анна', 'Москва', '1988-03-15'),
('Кузнецов', 'Дмитрий', 'Москва', '1995-02-22'),
('Васильев', 'Сергей', 'Новосибирск', '1980-09-12'),
('Горбунова', 'Ольга', 'Москва', '1992-11-30'),
('Зайцев', 'Андрей', 'Екатеринбург', '1991-06-06'),
('Михайлова', 'Марина', 'Москва', '1994-04-18'),
('Твен', 'Марк', 'Нью-Йорк', '1835-11-30');


-- Вставка данных в таблицу publisher
INSERT INTO publisher (pub_name, pub_kind) VALUES
('Наука и Техника', 'Science'),
('Энциклопедия', 'Reference'),
('Художественная литература', 'Fiction'),
('Туристическое издательство', 'Travel'),
('Факт', 'Reference'),
('Литературное издательство', 'Fiction');

-- Вставка данных в таблицу book
INSERT INTO book (isbn, title, author, pages_num, pub_year, pub_name) VALUES
('9781234567890', 'Горы и природа', 'Васильев В.', 350, 2010, 'Наука и Техника'),
('9781234567891', 'Энциклопедия гор', 'Иванов И.И.', 500, 2015, 'Энциклопедия'),
('9781234567892', 'Путешествия по горам', 'Петров П.П.', 450, 2018, 'Туристическое издательство'),
('9781234567893', 'Романы о природе', 'Сидоров А.А.', 300, 2020, 'Художественная литература'),
('9781111111112', 'Факты о космосе', 'Семенов С.С.', 360, 2014, 'Факт'),
('9781111111113', 'Туризм по России', 'Громов Г.Г.', 280, 2019, 'Туристическое издательство'),
('9781111111114', 'Астрономия для всех', 'Иванов И.И.', 400, 2012, 'Наука и Техника'),
('9781111111115', 'Звезды и планеты', 'Петров П.П.', 320, 2016, 'Наука и Техника'),
('9781111111116', 'Путешествие к звездам', 'Громов Г.Г.', 500, 2017, 'Туристическое издательство'),
('9781111111117', 'Альпинизм для начинающих', 'Васильев В.', 600, 2013, 'Наука и Техника'),
('9781111111118', 'Основы астрофизики', 'Семенов С.С.', 720, 2011, 'Наука и Техника'),
('9782222222221', 'Приключения Тома Сойера', 'Марк Твен', 200, 1876, 'Литературное издательство'),
('9782222222222', 'Приключения Гекльберри Финна', 'Марк Твен', 366, 1884, 'Литературное издательство'),
('9782222222223', 'Принц и нищий', 'Марк Твен', 320, 1881, 'Литературное издательство'),
('9782222222224', 'Янки из Коннектикута при дворе короля Артура', 'Марк Твен', 400, 1889, 'Литературное издательство'),
('9782222222225', 'Таинственный незнакомец', 'Марк Твен', 256, 1916, 'Литературное издательство'),
('9783333333331', 'Книга 1', 'Автор 1', 250, 1850, 'Литературное издательство'),
('9783333333332', 'Книга 2', 'Автор 2', 320, 1850, 'Литературное издательство'),
('9783333333333', 'Книга 3', 'Автор 3', 450, 1850, 'Литературное издательство'),
('9783333333334', 'Книга 4', 'Автор 4', 500, 1850, 'Литературное издательство'),
('9783333333335', 'Книга 5', 'Автор 5', 280, 1850, 'Литературное издательство'),
('9783333333336', 'Книга 6', 'Автор 6', 400, 1850, 'Литературное издательство'),
('9783333333337', 'Книга 7', 'Автор 7', 310, 1850, 'Литературное издательство'),
('9783333333338', 'Книга 8', 'Автор 8', 290, 1851, 'Литературное издательство'),
('9783333333339', 'Книга 9', 'Автор 9', 375, 1851, 'Литературное издательство'),
('9783333333340', 'Книга 10', 'Автор 10', 260, 1851, 'Литературное издательство'),
('9783333333341', 'Книга 11', 'Автор 11', 410, 1852, 'Литературное издательство'),
('9783333333345', 'Книга 15', 'Автор 11', 410, 1852, 'Литературное издательство'),
('9783333333342', 'Книга 12', 'Автор 12', 280, 1853, 'Литературное издательство'),
('9783333333343', 'Книга 13', 'Автор 13', 390, 1853, 'Литературное издательство');



-- Вставка данных в таблицу category с подкатегориями
INSERT INTO category (category_name, parent_cat) VALUES
('Mountains', NULL),
('Hiking', 'Mountains'),
('Climbing', 'Mountains'),
('Travel', NULL),
('Nature', NULL),
('Science', NULL),
('Astronomy', 'Science'),
('Astrophysics', 'Science'),
('Sports', NULL),
('Football', 'Sports'),
('Basketball', 'Sports'),
('Tennis', 'Sports'),
('Table Tennis', 'Tennis'),
('Swimming', 'Sports'),
('Olympic Swimming', 'Swimming'),
('Skiing', 'Sports'),
('Alpine Skiing', 'Skiing'),
('Cross-country Skiing', 'Skiing'),
('Volleyball', 'Sports');


-- Вставка данных в таблицу copy
INSERT INTO copy (isbn, copy_number, shelf, position) VALUES
('9781234567890', 1, 'A1', '1'),
('9781234567891', 1, 'B2', '3'),
('9781234567892', 1, 'C3', '5'),
('9781111111113', 1, 'C3', '3'),
('9781234567893', 1, 'D4', '7'),
('9781111111112', 1, 'B2', '2'),
('9781111111117', 1, 'E1', '1'),
('9781111111117', 2, 'E1', '2'),
('9781111111118', 1, 'F1', '5'),
('9781111111114', 1, 'F2', '3'),
('9781111111115', 1, 'F2', '4'),
('9781111111116', 1, 'G1', '1'),
('9782222222221', 1, 'H1', '3'),
('9782222222222', 1, 'H2', '2'),
('9782222222223', 1, 'H3', '4'),
('9782222222224', 1, 'H4', '5'),
('9782222222225', 1, 'H5', '6'),
('9782222222221', 2, 'H1', '4'),
('9782222222222', 2, 'H2', '3'),
('9782222222223', 2, 'H3', '5');


-- Вставка данных в таблицу borrowing
INSERT INTO borrowing (reader_nr, isbn, copy_number, return_date) VALUES
(1, '9781234567890', 1, '2023-01-10'),
(1, '9781234567891', 1, NULL),
(2, '9781234567892', 1, '2023-02-15'),
(3, '9781234567893', 1, '2023-03-20'),
(3, '9781111111112', 1, NULL),
(4, '9781111111113', 1, '2023-06-20'),
(5, '9781111111117', 1, '2023-09-15'),
(6, '9781111111116', 1, NULL),
(7, '9781111111118', 1, NULL);

INSERT INTO book_cat (isbn, category_name) VALUES
('9781234567890', 'Mountains'),
('9781234567890', 'Hiking'),
('9781234567891', 'Mountains'),
('9781234567891', 'Climbing'),
('9781234567891', 'Travel'),
('9781111111112', 'Science'),
('9781111111112', 'Astronomy'),
('9781111111115', 'Science'),
('9781111111113', 'Travel'),
('9781234567893', 'Nature');
